from django.urls import path

from . import views


urlpatterns = [

    # =====================================================
    # قائمة المبيعات
    # =====================================================

    path(
        "",
        views.sale_list,
        name="sale_list"
    ),


    # =====================================================
    # إنشاء فاتورة بيع
    # =====================================================

    path(
        "create/",
        views.sale_create,
        name="sale_create"
    ),


    # =====================================================
    # تفاصيل الفاتورة
    # =====================================================

    path(
        "<int:pk>/",
        views.sale_detail,
        name="sale_detail"
    ),

]